incompressibleFluid/channel395/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc fieldAverage(U, p, prime2Mean = yes)

#includeFunc uniform
(
    fieldType = volScalarField,
    field = half,
    dimensions = [],
    value = 0.5
)

#includeFunc mag(UPrime2Mean)

#includeFunc multiply(half, mag(UPrime2Mean), result = k)

#includeFunc graphLayerAverage
(
    name = layerAverage,
    patches = (bottomWall),
    axis = y,
    symmetric = yes,
    pMean,
    pPrime2Mean,
    UMean,
    UPrime2Mean,
    k
);

// ************************************************************************* //
